data1 = '은경\n강은경\n경욱\n오경욱\n상준\n고상준\n유빈\n고유빈\n유진\n고유진\n근희\n김근희\n남현\n김남현\n미선\n김미선\n김미애\n김미정\n미정\n김보라\n보라\n김보미\n보미\n'
data2 = '서인\n김서인\n선애\n김선애\n소리\n김소리\n싸리\n영민\n김영민\n유신\n김유신\n윤자\n자애\n김자애\n장호\n김장호\n정민\n김정민\n정연\n김정연\n정옥\n김정옥\n중열\n김중열\n'
data3 = '진선\n김진선\n하루\n하원\n김하원\n향\n김향\n호\n김호\n오주현\n데이빗\n제원\n류제원\n목사님\n승규\a문승규\n찬서\n문찬서\n채원\n문채원\n환희\n박환희\n'
data4 = '미소\n박미소\n민희\n박민희\n서희\n박서희\n세범\n박세범\n윤희\n박윤희\n제인\n지우\n박지우\n찰스\n현진\n박현진\n혜린\n박혜린\n혜인\n박혜인\n예진\n변예진\n'
data5 = '진수\n변진수\n철환\n변철환\n쿄타\n윤구\n서윤구\n윤지\n서윤지\n정진\n서정진\n주리\n선주리\n설\n정설\n단디\n다진\n송다진\n보영\n송보영\n정화\n송정화\n츄츄\n병근\n신병근\n'
data6 = '종훈\n신종훈\n지온\n신지온\n싸모님\n수현\n안수현\n지훈\n안지훈\n선경\n최선경\n봉엽\n오봉엽\n세현\n오세현\n성현\n오성현\n완택\n오완택\n준영\n오준영\n세량\n위세량\n'
data7 = '한나\n위한나\n한비\n위한비\n까루나\n동하\n이동하\n서은\n이서은\n선영\n이선영\n승엽\n이승엽\n영섭\n이영섭\n은혜\n이은혜\n익희\n이익희\n이주현\n지연\n이지연\n'
data8 = '충희\n이충희\n헤원\n이혜원\n성은\n임성은\n순환\n임순환\n지윤\n임지윤\n미성\n장미성\n장미애\n재순\n장재순\n진실\n장진실\n민율\n전민율\n단비\n정단비\n승민\n정승민\n'
data9 = '영경\n정영경\n우신\n정우신\n원영\n정원영\n은수\n정은수\n정지현\n안지현\n진호\n정진호\n현아\n정현아\n혜영\n정혜영\n금자\n조금자\n종문\n최종문\n다인\n주다인\n영준\n주영준\n'
data10 = '주혜인\n윤미\n최윤미\n종윤\n최종윤\n하루나\n하이\n호중\n홍\n규온\n황규온\n선화\n황선화\n성욱\n황성욱\n지희\n황지희\n선물\n서윤\n임서윤\n섬결\n이섬결\n하리\n남하리\n정준\n아영\n신아영\n이희도\n희도\n정헌\n아도\n민정\n충주\n이정헌\n이아도\n김민정\n이충주\n'
data11 = '공동체손님\n이부족\n앙상블\n거숨\n봉독대\n연극모임\n글쓰기모임\n안골청연\n농사팀\n휴먼스\n연극모임\n알바부족\n데코팀\n일부족\n삼부족\n사부족\n오부족\n육부족\n칠부족\n대안학교\n스텝팀\n'

name_tuple = [("강", "은경"), ("오", "경욱"), ("고", "상준"), ("고", "유빈"), ("고", "유진"), ("김", "남현"), ("김", "미선"), ("김", "미정"), ("김", "보라"), ("김", "보미"),
              ("김", "서인"), ("김", "선애"), ("김", "소리"), ("김", "영민"), ("김", "유신"), ("김", "자애"), ("김", "장호"), ("김", "정민"), ("김", "정연"), ("김", "정옥"),
              ("김", "중열"), ("김", "진선"), ("김", "하원"), ("김", "향"), ("김", "호"), ("류", "제원"), ("문", "승규"), ("문", "찬서"), ("문", "채원"), ("박", "환희"),
              ("박", "미소"), ("박", "민희"), ("박", "서희"), ("박", "세범"), ("박", "윤희"), ("박", "지우"), ("박", "현진"), ("박", "혜린"), ("변", "예진"),
              ("변", "진수"), ("변", "철환"), ("서", "윤구"), ("서", "윤지"), ("서", "정진"), ("선", "주리"), ("정", "설"), ("송", "다진"), ("송", "보영"), ("송", "정화"), ("신", "병근"),
              ("신", "종훈"), ("신", "아영"), ("신", "지온"), ("안", "수현"), ("안", "지훈"), ("최", "선경"), ("오", "봉엽"), ("오", "세현"), ("오", "성현"), ("오", "완택"), ("오", "준영"), ("위", "세량"),
              ("위", "한나"), ("위", "한비"), ("이", "동하"), ("이", "서은"), ("이", "선영"), ("이", "승엽"), ("이", "영섭"), ("이", "은혜"), ("이", "익희"), ("이", "지연"),
              ("이", "충희"), ("이", "혜원"), ("임", "성은"), ("임", "순환"), ("임", "지윤"), ("장", "미성"), ("장", "재순"), ("장", "진실"), ("전", "민율"), ("정", "단비"), ("정", "승민"),
              ("정", "영경"), ("정", "우신"), ("정", "원영"), ("정", "은수"), ("정", "진호"), ("정", "현아"), ("정", "혜영"), ("조", "금자"), ("최", "종문"), ("주", "다인"), ("주", "영준"),
              ("최", "윤미"), ("최", "종윤"), ("황", "규온"), ("황", "선화"), ("황", "성욱"), ("황", "지희"), ("임", "서윤"), ("이", "섬결"), ("남", "하리"), ("김", "근희"), ("이","희도"), ("이","정헌"), ("이", "아도"), ("김", "민정"), ("이", "충주")] # 이름들 추가,,(싸모님과 쭈이모를 어떻게 할지 고민해보자..)
# '향' 텍스트에서 체크하기.
import pandas as pd



jansu = '한잔\n두잔\n세잔\n네잔\n다섯잔\n여섯잔\n한개\n두개\n세개\n하나\n네개\n다섯개\n여섯개\n한캔\n두캔\n세캔\n네캔\n다섯캔\n여섯캔\n'

menu = '오트\n베리고\n아아\n에스프레소\n뜨아\n따아\n아메리카노\n라떼\n카페라떼\n카푸치노\n바닐라라떼\n아바라\n카페모카\n더치\n콜드브루\n더치라떼\n보리커피\n탄산수\n밀크티\n딸기라떼\n캐모마일\n루이보스\n보이차\n페퍼민트\n레몬그라스\n라벤더\n차\n티\n아이스크림\n녹차아이스크림\n제주누보\n맥주\n아바\n아보카도\n미숫가루\n망고\n망바\n아포카토\n아포카도\n아인슈페너\n포춘쿠키\n포춘\n민트초코라떼\n애플민트스무디\n쌍화탕\n보약\n아사히\n스피아민트라떼\n초코민트라떼\n페퍼민트라떼\n스민라\n페민라\n초민라\n망스\n드립\n섭\n민초라떼\n민초라\n레몬에이드\n패션후르츠에이드\n하이볼\n브륄레\n브릴레\n로즈마리라떼\n페퍼민트\n민트초코\n초코민트\n페퍼민트\n스피아민트\n아사이\n꼼빠냐\n로즈마리\n누보\n아보바나나\n튀일\n트윌\n튀일쿠키\n트윌쿠키\n포츈쿠키\n포츈\n유자민트\n유자민트티\n수제쿠키\n따라\n아라\n하이볼\n잭콜\n잭콕\n샹그리아\n모히또\n모히토\n깔루아밀크\n안주\n복숭아바질에이드\n복바에이드\n복숭아에이드\n아메\n오트\n칼루아밀크\n자두\n쌍화\n복바\n유자\n패션후르츠\n'


menu_list = ["베리고", "아아", "에스프레소", "뜨아", "따아", "아메리카노", "라떼", "카페라떼", "카푸치노", "바닐라라떼", "아바라", "카페모카", "더치", "콜드브루", "더치라떼", "보리커피", "탄산수", "밀크티", "딸기라떼", "캐모마일", "루이보스", "보이차", "패퍼민트", "레몬그라스", "라벤더", "차", "티", "아이스크림","녹차아이스크림", "제주누보", "맥주", "아바", "아보카도", "미숫가루", "망고", "망바", "아포카토", "아인슈페너", "포춘쿠키", "포츈쿠키", "민트초코라떼", "애플민트스무디", "쌍화탕", "보약", "아사히", "스피아민트라떼", "초코민트라떼", "페퍼민트라떼", "스민라", "페민라", "초민라", "망스", "드립", "섭", "민초라떼", "민초라", "레몬에이드", "패션후르츠에이드", "하이볼", "브륄레", "브릴레", "로즈마리라떼","페퍼민트","민트초코","초코민트","페퍼민트","스피아민트","아사이","꼼빠냐","로즈마리","누보","포춘","아보바나나","튀일","트윌","비건","아몬드","수제","튀일쿠키","트윌쿠키","포츈","포츈쿠키","유자민트","유자민트티","아보카도","수제쿠키","따라","아라","하이볼", "잭콕","잭콜","깔루아밀크","안주", "샹그리아", "모히또","모히토","복숭아바질에이드", "복바에이드", "복숭아에이드","아메","칼루아밀크","자두","쌍화","복바","유자","패션후르츠","탄산","복숭아"] # 메뉴 추가

zumun = ["부탁", "마십니다","마십니다요", "마셔용", "마셨어요", "마셨습니다", "먹어요", "먹어여", "먹어용", "먹었어요","먹었오요","먹었어여", "먹었습니다", "먹습니다","먹습니다요" ,"먹습니당", "가져가요", "가져가용", "가져갑니다","가져갑니다요", "가져갑니당", "주문", "주세요", "마셔요", "가져갔어요","가져갔습니다","가져갔습니당", "가져갈게요", "가져갈게용", "가져가셨어요","가져왔어요","가져", "먹을게요", "먹을께요"]

dic_num = {"한잔" : 1, "두잔" : 2, "세잔" : 3, "네잔" : 4, "다섯잔" : 5, "여섯잔" : 6, "일곱잔" : 6, "1" : 1, "2" : 2, "3" : 3, "4" : 4, "5" : 5, "6" : 6, "7" : 7, "8" : 8, "9" : 9, "10" : 10, "11" : 11,"12":12,"13":13,"14":14,"15":15,"16":16,"17":17,"18":18,"19":19,"20":20,"21":21,"22":22,"23":23,"24":24,"25":25,"26":26,"27":27,"28":28,"29":29,"30":30,"31":31,"32":32,"33":33,"34":34,"35":35,"36":36,"37":37,"38":38,"39":39,"40":40,"41":41,"42":42,"43":43,"44":44,"45":45,"46":46,"47":47,"48":48,"49":49,"50":50, "한개" : 1, "두개" : 2, "세개" : 3,
           "네개" : 4, "다섯개" : 5, "여섯개" : 6, "일곱개" : 7, "한캔" : 1, '두캔' : 2, "세캔" :3, "네캔" :4, "다섯캔" : 5, "여섯캔" : 6, "일곱캔" : 6, "하나" : 1}

eat_and_gift_sum = {"sum" : 0}

dic_name = {"은경" : [0, 0, 0, 0, 0], "상준" : [0, 0, 0, 0, 0], "유빈" : [0, 0, 0, 0, 0], "유진" : [0, 0, 0, 0, 0], "은미" : [0, 0, 0, 0, 0], "규열" : [0, 0, 0, 0, 0], "남현" : [0, 0, 0, 0, 0], "미선" : [0, 0, 0, 0, 0], "김미애" : [0, 0, 0, 0, 0],
            "미정" : [0, 0, 0, 0, 0], "보라" : [0, 0, 0, 0, 0], "민정" : [0, 0, 0, 0, 0], "보미" : [0, 0, 0, 0, 0], "서인" : [0, 0, 0, 0, 0], "선애" : [0, 0, 0, 0, 0], "소리" : [0, 0, 0, 0, 0], "영민" : [0, 0, 0, 0, 0], "유신" : [0, 0, 0, 0, 0], "자애" : [0, 0, 0, 0, 0],
            "정연" : [0, 0, 0, 0, 0], "정옥" : [0, 0, 0, 0, 0], "중열" : [0, 0, 0, 0, 0], "하연" : [0, 0, 0, 0, 0], "향" : [0, 0, 0, 0, 0], "호" : [0, 0, 0, 0, 0], "제원" : [0, 0, 0, 0, 0], "승규" : [0, 0, 0, 0, 0], "찬서" : [0, 0, 0, 0, 0],
            "채원" : [0, 0, 0, 0, 0], "미소" : [0, 0, 0, 0, 0], "목사님" :[0, 0, 0, 0, 0], "민희" : [0, 0, 0, 0, 0], "서희" : [0, 0, 0, 0, 0], "세범" : [0, 0, 0, 0, 0], "제인" : [0, 0, 0, 0, 0], "지우" : [0, 0, 0, 0, 0], "윤희" : [0, 0, 0, 0, 0],
            "혜린" : [0, 0, 0, 0, 0], "박혜인" : [0, 0, 0, 0, 0], "환희" : [0, 0, 0, 0, 0], "예진" : [0, 0, 0, 0, 0], "진수" : [0, 0, 0, 0, 0], "진영" : [0, 0, 0, 0, 0], "철환" : [0, 0, 0, 0, 0], "싸모님" : [0, 0, 0, 0, 0], "윤구" : [0, 0, 0, 0, 0],
            "윤지" : [0, 0, 0, 0, 0], "주리" : [0, 0, 0, 0, 0], "다진" : [0, 0, 0, 0, 0], "보영" : [0, 0, 0, 0, 0], "연정" : [0, 0, 0, 0, 0], "정화" : [0, 0, 0, 0, 0], "병근" : [0, 0, 0, 0, 0], "종훈" : [0, 0, 0, 0, 0], "아영" : [0, 0, 0, 0, 0],  "지온" : [0, 0, 0, 0, 0],
            "수현" : [0, 0, 0, 0, 0], "안지현" : [0, 0, 0, 0, 0], "지훈" : [0, 0, 0, 0, 0], "경욱" : [0, 0, 0, 0, 0], "봉엽" : [0, 0, 0, 0, 0], "세현" : [0, 0, 0, 0, 0], "완택" : [0, 0, 0, 0, 0],"성현" : [0, 0, 0, 0, 0], "오주현" : [0, 0, 0, 0, 0], "준영" : [0, 0, 0, 0, 0],
            "윤보라" : [0, 0, 0, 0, 0],"세량" : [0, 0, 0, 0, 0], "한나" : [0, 0, 0, 0, 0], "한비" : [0, 0, 0, 0, 0], "까루나" : [0, 0, 0, 0, 0], "동하" : [0, 0, 0, 0, 0], "상원" : [0, 0, 0, 0, 0], "서은" : [0, 0, 0, 0, 0], "선영" : [0, 0, 0, 0, 0],
            "승엽" : [0, 0, 0, 0, 0], "희도" : [0, 0, 0, 0, 0], "정헌" : [0, 0, 0, 0, 0], "아도" : [0, 0, 0, 0, 0], "충주" : [0, 0, 0 ,0 ,0], "영섭" : [0, 0, 0, 0, 0], "은혜" : [0, 0, 0, 0, 0], "익희" : [0, 0, 0, 0, 0], "이주현" : [0, 0, 0, 0, 0], "지연" : [0, 0, 0, 0, 0], "충희" : [0, 0, 0, 0, 0], "혜원" : [0, 0, 0, 0, 0], 
            "성은" : [0, 0, 0, 0, 0], "순환" : [0, 0, 0, 0, 0], "지윤" : [0, 0, 0, 0, 0], "서윤" : [0, 0, 0, 0, 0], "미성" : [0, 0, 0, 0, 0], "장미애" : [0, 0, 0, 0, 0], "재순" : [0, 0, 0, 0, 0], "진실" : [0, 0, 0, 0, 0], "호중" : [0, 0, 0, 0, 0],
            "민율" : [0, 0, 0, 0, 0], "설" : [0, 0, 0, 0, 0], "성하" : [0, 0, 0, 0, 0], "승민" : [0, 0, 0, 0, 0], "아인" : [0, 0, 0, 0, 0],"영경" : [0, 0, 0, 0, 0], "우신" : [0, 0, 0, 0, 0], "원영" : [0, 0, 0, 0, 0], "은수" : [0, 0, 0, 0, 0], 
            "정준" : [0, 0, 0, 0, 0], "정지현" : [0, 0, 0, 0, 0], "진호" : [0, 0, 0, 0, 0], "현아" : [0, 0, 0, 0, 0], "혜영" : [0, 0, 0, 0, 0],"다인" : [0, 0, 0, 0, 0], "영준" : [0, 0, 0, 0, 0], "주혜인" :[0, 0, 0, 0, 0],"쿄타" : [0, 0, 0, 0, 0], "선경" : [0, 0, 0, 0, 0], "윤미" : [0, 0, 0, 0, 0], 
            "종문" : [0, 0, 0, 0, 0], "종윤" : [0, 0, 0, 0, 0], "선화" : [0, 0, 0, 0, 0], "성욱" : [0, 0, 0, 0, 0], "지희" : [0, 0, 0, 0, 0], "규온" : [0, 0, 0, 0, 0], "하원" : [0, 0, 0, 0, 0], "하루" : [0, 0, 0, 0, 0], "하루나" : [0, 0, 0, 0, 0],
            "하이" : [0, 0, 0, 0, 0], "홍" : [0, 0, 0, 0, 0], "싸리" : [0, 0, 0, 0, 0], "츄츄" : [0, 0, 0, 0, 0], "찰스" : [0, 0, 0, 0, 0], "단디" : [0, 0, 0, 0, 0], "정진" : [0, 0, 0, 0, 0],
            "진선" : [0, 0, 0, 0, 0], "데이빗" : [0, 0, 0, 0, 0], "윤자" : [0 ,0, 0, 0, 0], "금자" : [0, 0, 0, 0, 0], "장호" : [0, 0, 0, 0, 0], "근희": [0, 0, 0, 0, 0], "정민": [0 ,0 ,0 ,0 ,0], "현진" : [0, 0, 0, 0, 0], "단비" : [0 ,0 ,0 ,0 ,0],
            "섬결":[0, 0, 0, 0, 0], "하리":[0, 0 ,0 ,0 ,0],"앙상블" : [0, 0, 0, 0, 0], "거숨" : [0, 0, 0, 0, 0], "봉독대" : [0, 0, 0, 0, 0], "연극모임" : [0, 0, 0, 0, 0], 
            "글쓰기모임" : [0, 0, 0, 0, 0], "안골청연" : [0, 0, 0, 0, 0], "농사팀" : [0, 0, 0, 0, 0], "숨" : [0, 0, 0, 0, 0], "휴먼스" : [0, 0, 0, 0, 0], "교사페이" : [0, 0, 0, 0, 0], "알바부족" : [0, 0, 0, 0, 0], "오늘교육원" : [0, 0, 0, 0, 0], "데코팀" : [0, 0, 0, 0, 0], 
            "스텝팀" : [0, 0, 0, 0, 0], "대안학교" : [0, 0, 0, 0, 0], "캐나다섬김팀" : [0, 0, 0, 0, 0], "공동체손님" : [0, 0, 0, 0, 0], "일부족" : [0, 0, 0, 0, 0], "이부족" : [0, 0, 0, 0, 0], "삼부족" : [0, 0, 0, 0, 0], "사부족" : [0, 0, 0, 0, 0], "오부족" : [0, 0, 0, 0, 0], "육부족" : [0, 0, 0, 0, 0],
            "칠부족" : [0, 0, 0, 0, 0], "강은경" : [0, 0, 0, 0, 0], "고상준" : [0, 0, 0, 0, 0], "고유빈" : [0, 0, 0, 0, 0], "고유진" : [0, 0, 0, 0, 0], "고은미" : [0, 0, 0, 0, 0], "김규열" : [0, 0, 0, 0, 0], "김남현" : [0, 0, 0, 0, 0], "김미선" : [0, 0, 0, 0, 0],
            "김미정" : [0, 0, 0, 0, 0], "김보라" : [0, 0, 0, 0, 0], "김보미" : [0, 0, 0, 0, 0], "김서인" : [0, 0, 0, 0, 0], "김선애" : [0, 0, 0, 0, 0], "김소리" : [0, 0, 0, 0, 0], "김영민" : [0, 0, 0, 0, 0], "김유신" : [0, 0, 0, 0, 0], "김자애" : [0, 0, 0, 0, 0],
            "김정연" : [0, 0, 0, 0, 0], "김정옥" : [0, 0, 0, 0, 0], "김중열" : [0, 0, 0, 0, 0], "김하연" : [0, 0, 0, 0, 0], "김향" : [0, 0, 0, 0, 0], "김호" : [0, 0, 0, 0, 0], "류제원" : [0, 0, 0, 0, 0], "문승규" : [0, 0, 0, 0, 0], "문찬서" : [0, 0, 0, 0, 0],
            "문채원" : [0, 0, 0, 0, 0], "박미소" : [0, 0, 0, 0, 0], "박민희" : [0, 0, 0, 0, 0], "박서희" : [0, 0, 0, 0, 0], "박세범" : [0, 0, 0, 0, 0], "박제인" : [0, 0, 0, 0, 0], "박지우" : [0, 0, 0, 0, 0], "박윤희" : [0, 0, 0, 0, 0],
            "박혜린" : [0, 0, 0, 0, 0], "박환희" : [0, 0, 0, 0, 0], "변예진" : [0, 0, 0, 0, 0], "변진수" : [0, 0, 0, 0, 0], "변진영" : [0, 0, 0, 0, 0], "변철환" : [0, 0, 0, 0, 0], "서윤구" : [0, 0, 0, 0, 0],
            "서윤지" : [0, 0, 0, 0, 0], "선주리" : [0, 0, 0, 0, 0], "송다진" : [0, 0, 0, 0, 0], "송보영" : [0, 0, 0, 0, 0], "송연정" : [0, 0, 0, 0, 0], "송정화" : [0, 0, 0, 0, 0], "신병근" : [0, 0, 0, 0, 0], "신종훈" : [0, 0, 0, 0, 0], "신아영" : [0, 0, 0, 0, 0],  "신지온" : [0, 0, 0, 0, 0],
            "안수현" : [0, 0, 0, 0, 0], "안지훈" : [0, 0, 0, 0, 0], "오경욱" : [0, 0, 0, 0, 0], "오봉엽" : [0, 0, 0, 0, 0], "오세현" : [0, 0, 0, 0, 0], "오완택" : [0, 0, 0, 0, 0],"오준영" : [0, 0, 0, 0, 0],
            "위세량" : [0, 0, 0, 0, 0], "위한나" : [0, 0, 0, 0, 0], "위한비" : [0, 0, 0, 0, 0], "이동하" : [0, 0, 0, 0, 0], "이상원" : [0, 0, 0, 0, 0], "이서은" : [0, 0, 0, 0, 0], "이선영" : [0, 0, 0, 0, 0],
            "이승엽" : [0, 0, 0, 0, 0], "이영섭" : [0, 0, 0, 0, 0], "이은혜" : [0, 0, 0, 0, 0], "이익희" : [0, 0, 0, 0, 0], "이지연" : [0, 0, 0, 0, 0], "이충희" : [0, 0, 0, 0, 0], "이혜원" : [0, 0, 0, 0, 0], 
            "임성은" : [0, 0, 0, 0, 0], "임순환" : [0, 0, 0, 0, 0], "임지윤" : [0, 0, 0, 0, 0], "임서윤" : [0, 0, 0, 0, 0], "장미성" : [0, 0, 0, 0, 0], "장재순" : [0, 0, 0, 0, 0], "장진실" : [0, 0, 0, 0, 0],
            "전민율" : [0, 0, 0, 0, 0], "정설" : [0, 0, 0, 0, 0], "정성하" : [0, 0, 0, 0, 0], "정승민" : [0, 0, 0, 0, 0], "정아인" : [0, 0, 0, 0, 0],"정영경" : [0, 0, 0, 0, 0], "정우신" : [0, 0, 0, 0, 0], "정원영" : [0, 0, 0, 0, 0], "정은수" : [0, 0, 0, 0, 0], 
            "정진호" : [0, 0, 0, 0, 0], "정현아" : [0, 0, 0, 0, 0], "정혜영" : [0, 0, 0, 0, 0],"주다인" : [0, 0, 0, 0, 0], "주영준" : [0, 0, 0, 0, 0], "최선경" : [0, 0, 0, 0, 0], "최윤미" : [0, 0, 0, 0, 0], 
            "최종문" : [0, 0, 0, 0, 0], "최종윤" : [0, 0, 0, 0, 0], "황선화" : [0, 0, 0, 0, 0], "황성욱" : [0, 0, 0, 0, 0], "황지희" : [0, 0, 0, 0, 0], "황규온" : [0, 0, 0, 0, 0], "김하원" : [0, 0, 0, 0, 0], "조금자" : [0, 0, 0, 0, 0],
            "김장호" : [0, 0, 0, 0, 0], "김근희" : [0, 0, 0, 0, 0], "김정민" : [0, 0, 0, 0, 0], "박현진" : [0, 0, 0, 0, 0], "정단비" : [0, 0, 0, 0, 0], "이섬결" : [0, 0, 0, 0, 0], "남하리" : [0 , 0, 0 ,0, 0], "김진선" : [0, 0, 0, 0, 0],
            "서정진" : [0, 0, 0, 0, 0], "오성현" : [0 ,0 ,0 ,0 ,0], "김민정" :[0, 0, 0, 0, 0], "이충주" : [0, 0, 0 ,0, 0], "이아도" : [0, 0, 0, 0, 0], "이희도" :[0, 0, 0, 0, 0], "이정헌" : [0, 0, 0, 0, 0]
            }
                #   내 먹  주 받 남
                
                

#print(dic_name_filt) # 안지현 정지현, [목사님]대표님 페크하기, [싸모님]사모님싸모사모 체크하기, [이주현]이쭈쭈체크하기, [오주현]오쭈체크하기, 
    
dic_name_filt = {}
count = 0  
for key, value in dic_name.items():
    if count < 167:
        dic_name_filt[key] = value
        count += 1
    else:
        break
